tap "algolia/algolia-cli"
tap "algolia/solutions-team"
tap "coursier/formulas"
tap "getantibody/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "sj14/tap"
# Browser automation CLI for AI agents
brew "agent-browser"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Modern, maintained replacement for ls
brew "eza"
# CLI tool for quick access to files and directories
brew "fasd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# JSON diff and patch
brew "jd"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Yet Another Dotfiles Manager
brew "yadm"
# UNIX shell (command interpreter)
brew "zsh"
# Tool for writing better scripts
brew "zx"
# Algolia CLI utility
brew "algolia/algolia-cli/algolia"
# Converts an Algolia filter expression to conjunctive normal form (CNF).
brew "algolia/solutions-team/cnf"
# Bash script to move AI configuration between Algolia indices
brew "algolia/solutions-team/copy-ai-config"
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task"
# Easily convert epoch timestamps to human readable formats and vice versa.
brew "sj14/tap/epoch"
# Command-line interface for 1Password
cask "1password-cli"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Memory training application
cask "anki"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Developer platform
cask "dotnet-sdk"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-gentium-plus"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logi-options+"
# Software for Logitech devices
cask "logitech-options"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Time tracker
cask "toggl-track"
vscode "akamud.vscode-theme-onedark"
vscode "anthropic.claude-code"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "codesandbox-io.codesandbox-projects"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ericadamski.carbon-now-sh"
vscode "huibizhang.codesnap-plus"
vscode "masko.masko-terminal-focus"
vscode "mechatroner.rainbow-csv"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "openai.chatgpt"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "robertostermann.vscode-codesnap-extended"
vscode "scala-lang.scala"
vscode "shopify.theme-check-vscode"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
